@extends('layouts.app')

@section('content')

    <h1>取引新規作成ページ</h1>
    
    @if (Auth::check())
        <?php $user = Auth::user(); ?>
        <div class="row">
            <aside class="col-xs-4">
                
          {!! Form::open(['route' => 'deals.store']) !!}
                <div class="form-group">
                    {!! Form::label('year', '年') !!}
                    {!! Form::select('year',['2016'=>'2016', '2017'=>'2017','2018'=>'2018'], null,['class' => 'form-control']) !!}
                <div class="form-group">
                    {!! Form::label('month', '月') !!}
                     {!! Form::select('month',['1'=>'1', '2'=>'2','3'=>'3','4'=>'4','5'=>'5','6'=>'6','7'=>'7','8'=>'8','9'=>'9','10'=>'10','11'=>'11','12'=>'12'], null,['class' => 'form-control']) !!}
                <div class="form-group">
                    {!! Form::label('day', '日') !!}
                     {!! Form::select('day',['1'=>'1', '2'=>'2','3'=>'3','4'=>'4','5'=>'5','6'=>'6','7'=>'7','8'=>'8','9'=>'9','10'=>'10','11'=>'11','12'=>'12','13'=>'13','14'=>'14','15'=>'15','16'=>'16','17'=>'17','18'=>'18','19'=>'19','20'=>'20','21'=>'21','22'=>'22','23'=>'23','24'=>'24','25'=>'25','26'=>'26','27'=>'27','28'=>'28','29'=>'29','30'=>'30','31'=>'31'], null,['class' => 'form-control']) !!}
                <div class="form-group">
                    {!! Form::label('amount', '金額') !!}
                    {!! Form::text('amount', old('amount'), ['class' => 'form-control']) !!}
                </div>

                <div class="form-group">
                    {!! Form::label('attribute', '収支') !!}
                    {!! Form::select('attribute',['収入'=>'収入', '支出'=>'支出'], null,['class' => 'form-control']) !!}
                </div>
                
                <div class="form-group">
                    {!! Form::label('category_id', '大区分') !!}
                    {!! Form::select('category_id',['本業'=>'本業','本業以外'=>'本業以外','居住費'=>'居住費','食費'=>'食費','光熱水費'=>'光熱水費','車関係'=>'車関係','日用雑貨費'=>'日用雑貨費','通信費'=>'通信費','保険'=>'保険','医療費'=>'医療費','交際費'=>'交際費','教養娯楽費'=>'教養娯楽費','その他経費'=>'その他経費','年金'=>'年金'], null,['class' => 'form-control']) !!}
                </div>
                
                <div class="form-group">
                    {!! Form::label('item_id', '小区分') !!}
                    {!! Form::select('item_id',['夫手取り'=>'夫手取り','妻手取り'=>'妻手取り','ポイントサイト'=>'ポイントサイト','家賃'=>'家賃','食品'=>'食品','外食'=>'外食','ガス'=>'ガス','水道'=>'水道','電気'=>'電気','灯油'=>'灯油','ガソリン'=>'ガソリン','交通費'=>'交通費','整備等'=>'整備等','日用品'=>'日用品','インターネット'=>'インターネット','携帯'=>'携帯','生命保険'=>'生命保険','病院'=>'病院','薬'=>'薬','お祝い'=>'お祝い','お土産'=>'お土産','人付合い'=>'人付合い','娯楽'=>'娯楽','趣味'=>'趣味','家具家電'=>'家具家電','雑費'=>'雑費','仕事関係'=>'仕事関係','被服'=>'被服','理美容費'=>'理美容費','借入金返済（無利子）'=>'借入金返済（無利子）','国民年金追納'=>'国民年金追納',], null,['class' => 'form-control']) !!}

                </div>
                
                {!! Form::submit('登録', ['class' => 'btn btn-primary btn-block']) !!}
            {!! Form::close() !!}
   @endif

@endsection